---
kind: property
id: P:Autodesk.Revit.DB.BaseImportOptions.ColorMode
source: html/eaa2af9c-97e4-ac51-32b1-b64c3d29168e.htm
---
# Autodesk.Revit.DB.BaseImportOptions.ColorMode Property

Color mode for the import.
 Three modes are supported. Black and White, Preserve Colors, and Invert Colors.

## Syntax (C#)
```csharp
public ImportColorMode ColorMode { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration